Dlubal.DynamPro.IModuleCase
Interface for working with module case.

Dlubal.DynamPro.IModuleCase.SetGeneralParams(System.UInt32@)
Sets general parameters.
Params: General parameters

Dlubal.DynamPro.IModuleCase.GetGeneralParams
Gets general parameters.
Returns: General parameters

Dlubal.DynamPro.IModuleCase.SetDetails(System.UInt32@)
Sets settings -> details.
Params: settings/details

Dlubal.DynamPro.IModuleCase.GetDetails
Gets settings -> details.
Returns: settings/details

Dlubal.DynamPro.IModuleCase.AddMC
Adds a new mass case.
Returns: Number of added mass case

Dlubal.DynamPro.IModuleCase.RemoveMC(System.Int32)
Removes mass case.
No: Number of mass case to be deleted

Dlubal.DynamPro.IModuleCase.GetExistingMC
Gets list of existing mass cases.
Returns: Array containing numbers of existing mass cases.

Dlubal.DynamPro.IModuleCase.GetMCParams(System.Int32)
Gets parameters of given mass case.
Returns: Mass case parameters
No: Number of mass case whose parameters will be fetched

Dlubal.DynamPro.IModuleCase.SetMCParams(System.Int32,System.UInt32@)
Sets parameters of given mass case.
No: Number of mass case whose parameters will be set
Params: mass case parameters

Dlubal.DynamPro.IModuleCase.AddMCO
Adds a new mass combination.
Returns: Number of added mass combination

Dlubal.DynamPro.IModuleCase.RemoveMCO(System.Int32)
Removes mass combination.
No: Number of mass combination to be deleted

Dlubal.DynamPro.IModuleCase.GetExistingMCO
Gets list of existing mass combinations.
Returns: Array containing numbers of existing mass combinations.

Dlubal.DynamPro.IModuleCase.GetMCOParams(System.Int32)
Gets parameters of given mass combination.
Returns: Mass combination parameters
No: Number of mass combination whose parameters will be fetched

Dlubal.DynamPro.IModuleCase.SetMCOParams(System.Int32,System.UInt32@)
Sets parameters of given mass combination.
No: Number of mass combination whose parameters will be set
Params: Mass combination parameters

Dlubal.DynamPro.IModuleCase.AddNVC
Adds a new natural vibration case.
Returns: Number of added natural vibration case

Dlubal.DynamPro.IModuleCase.RemoveNVC(System.Int32)
Removes natural vibration case.
No: Number of the natural vibration case to be deleted

Dlubal.DynamPro.IModuleCase.GetExistingNVC
Gets list of existing natural vibration cases.
Returns: Array containing numbers of existing natural vibration cases.

Dlubal.DynamPro.IModuleCase.GetNVCParams(System.Int32)
Gets parameters of given natural vibration case.
Returns: Natural vibration case parameters
No: Number of the natural vibration case whose parameters will be fetched

Dlubal.DynamPro.IModuleCase.SetNVCParams(System.Int32,System.UInt32@)
Sets parameters of given natural vibration case.
No: Number of the natural vibration case whose parameters will be set
Params: Number of the natural vibration case whose parameters will be set

Dlubal.DynamPro.IModuleCase.HasNVCResults(System.Int32)
Queries to NVC to check whether it has results.
Returns: BOOL indicating whether given NVC has results
No: Number of the natural vibration case

Dlubal.DynamPro.IModuleCase.AddRS
Adds a new response spectra case.
Returns: Number of the new response spectra case

Dlubal.DynamPro.IModuleCase.RemoveRS(System.Int32)
Removes response spectra case.
No: Number of the response spectra case to be deleted

Dlubal.DynamPro.IModuleCase.GetExistingRS
Gets list of existing response spectra cases.
Returns: Array containing numbers of existing response spectra cases.

Dlubal.DynamPro.IModuleCase.GetRSParams(System.Int32)
Gets parameters of given response spectra case.
Returns: Response spectra case parameters
No: Number of the response spectra case whose parameters will be fetched

Dlubal.DynamPro.IModuleCase.SetRSParams(System.Int32,System.UInt32@)
Sets parameters of given response spectra case.
No: Number of response spectra case whose parameters will be set
Params: Number of response spectra case whose parameters will be set

Dlubal.DynamPro.IModuleCase.AddDLC(System.UInt32)
Adds a new dynamic load case.
Returns: Number of the new dynamic load case

Dlubal.DynamPro.IModuleCase.RemoveDLC(System.Int32)
Removes dynamic load case.
No: Number of the dynamic load case to be deleted

Dlubal.DynamPro.IModuleCase.GetExistingDLC
Gets list of existing dynamic load cases.
Returns: Array containing numbers of existing dynamic load cases.

Dlubal.DynamPro.IModuleCase.GetDLCParams(System.Int32)
Gets parameters of given dynamic load case.
Returns: Dynamic load case parameters
No: Number of the dynamic load case whose parameters will be fetched

Dlubal.DynamPro.IModuleCase.SetDLCParams(System.Int32,System.UInt32@)
Sets parameters of given dynamic load case.
No: Number of dynamic load case whose parameters will be set
Params: Dynamic load case parameters that will be set

Dlubal.DynamPro.IModuleCase.GetDLCResponseSpectraAnalysisParams(System.Int32)
Gets parameters of given dynamic load case with response spectra analysis.
Returns: Dynamic load case parameters
No: Number of the dynamic load case whose parameters will be fetched

Dlubal.DynamPro.IModuleCase.SetDLCResponseSpectraAnalysisParams(System.Int32,System.UInt32@)
Sets parameters of given dynamic load case with response spectra analysis.
No: Number of dynamic load case whose parameters will be set
Params: Response Spectra parameters that will be set

Dlubal.DynamPro.IModuleCase.GetDLCEquivalentStaticForceAnalysisParams(System.Int32)
Gets parameters of given dynamic load case with equivalent static force analysis.
Returns: Equivalent Forces parameters
No: Number of the dynamic load case whose parameters will be fetched

Dlubal.DynamPro.IModuleCase.SetDLCEquivalentStaticForceAnalysisParams(System.Int32,System.UInt32@)
Sets parameters of given dynamic load case with equivalent static force analysis.
No: Number of dynamic load case whose parameters will be set
Params: Equivalent Forces parameters will be set

Dlubal.DynamPro.IModuleCase.GetDLCModeShapesParams(System.Int32)
Gets parameters of given dynamic load case with time history analysis with load time diagram.
Returns: Mode Shapes parameters
No: Number of the dynamic load case whose parameters will be fetched

Dlubal.DynamPro.IModuleCase.SetDLCModeShapesParams(System.Int32,System.UInt32@)
Sets parameters of given dynamic load case with time history analysis with load time diagram.
No: Number of dynamic load case whose parameters will be set
Params: Mode Shapes parameters that will be set

Dlubal.DynamPro.IModuleCase.GetDLCDampingParams(System.Int32)
Gets parameters of given dynamic load case with time history analysis with load time diagram.
Returns: Damping parameters
No: Number of the dynamic load case whose parameters will be fetched

Dlubal.DynamPro.IModuleCase.SetDLCDampingParams(System.Int32,System.UInt32@)
Sets parameters of given dynamic load case with time history analysis with load time diagram.
No: Number of dynamic load case whose parameters will be set
Params: Damping parameters that will be set

Dlubal.DynamPro.IModuleCase.HasDLCResults(System.Int32)
Queries to dynamic load case to check if it has results.
Returns: BOOL indicating whether given DLC has results
No: Number of the dynamic load case